{
  "processed_ids": [
    "October 23, 2025-By Jasmine Stoy With marketing templates that are now connected to your design system, plugins that pull in your favorite apps, and video trimming in Figma Buzz, we’re giving designers and marketers new tools to create branded assets that speak volumes.",
    "Dec 10, 2025-New ways to edit images in Design and Draw",
    "December 5, 2025-By Figma Figma introduces new governance features for enterprise customers, with local data residency expected next quarter.",
    "May 7, 2025-By Lauren Budorick, Joel Miller, Tim Van Damme, Rogie King Figma Draw pairs faster, simpler vector editing with powerful tools for visual expression—so designers of all stripes can bring their vision to life without breaking focus.",
    "Nov 20, 2025-Multi-brand scale with extended collections",
    "September 10, 2025-Are roles and responsibilities a thing of the past?",
    "Dec 11, 2025-Publish Buzz Templates with Variable Modes",
    "November 18, 2025-By Loredana Crisan We ran Gemini 3 Pro through a series of design exercises in Figma Make. Here’s what stood out.",
    "December 12, 2025-By Nikolas Klein Figma designer–turned–product manager Nikolas Klein worked on building prototyping tools for seven years. Then AI changed the game.",
    "May 7, 2025-By Adam Lehman, Taryn Cowart, Lauren Byrne Today, we’re launching Figma Sites, an all-in-one tool for you to design and build custom, responsive websites. Here, we share how you can go from design to production in the most efficient—and expressive—ways.",
    "November 6, 2025-By Figma Today, ServiceNow, the AI platform for business transformation, and Figma announced a strategic collaboration to turn design vision into enterprise transformation.",
    "September 12, 2025-By Andrew Hogan The next leap in AI won’t come from new models alone—the app layer will be what makes new technology stick.",
    "December 11, 2025-By Figma With Figma Make now available in Figma for Government, teams can prototype faster, collaborate securely, and accelerate progress on modernizing public services.",
    "May 7, 2025-By Dylan Field Dylan Field runs down everything we launched at Config 2025 and explains why pushing design further matters more now than ever.",
    "Nov 18, 2025-Test experimental AI models in Figma Make, starting with Gemini 3 Pro",
    "November 19, 2025-By Emma Webster As AI reshapes how we make products, design systems are evolving from libraries of reusable parts into living frameworks that scale taste and craft. We spoke with product leaders and practitioners about the shifts they’re seeing in how design systems are built, used, and maintained.",
    "June 4, 2025-By Jake Albaugh Today we’re announcing the beta release of the Figma MCP server, which brings Figma directly into the developer workflow to help LLMs achieve design-informed code generation.",
    "November 20, 2025-By Noah Levin From quick style variations to precise edits, Nano Banana Pro helps teams stay creative without losing context or brand integrity.",
    "Dec 11, 2025-Turn your ChatGPT conversations into Figma Slides presentations and Figma Buzz assets",
    "Oct 28, 2025-Everything we covered at Schema by Figma",
    "December 3, 2025-Double click: What does it mean to be a designer in the age of AI?",
    "September 24, 2025-By Thomas Lowry As developers increasingly use agentic coding tools, the structure and clarity of design files matters more than ever. By thoughtfully organizing your work, you can help your developer counterparts build more efficiently and accurately.",
    "September 23, 2025-By Kris Rasmussen Our latest updates to the Figma MCP server and Code Connect bring Figma design context anywhere you work.",
    "December 9, 2025-Updates to AI credits in Figma",
    "October 23, 2025-By Dave Martin Solving security challenges at scale requires creativity as much as rigor. To reduce the risk of sensitive data exposure, we built Response Sampling: a lightweight, real-time control that watches outbound responses, validates access, and provides an early warning system across our products.",
    "June 10, 2025-By Alexia Danton Here, we share our team’s favorite prompts, pro tips, and best practices for using Figma Make to help you get the most out of our recently launched prompt-to-code feature.",
    "October 28, 2025-By Paige Costello Design systems help teams push what’s possible while maintaining a high level of craft, polish, and performance. Here’s everything we announced at Schema by Figma to help teams design for the AI era.",
    "December 16, 2025-By Jenny Xie We sat down with linguist Adam Aleksic, author of “Algospeak: How Social Media Is Transforming the Future of Language,” to learn how algorithms shape not just how we talk, but how we think and relate.",
    "November 6, 2025-By Figma When things move fast, foundations matter more than ever.",
    "Dec 11, 2025-Make in FigGov",
    "September 25, 2025-By Nikolas Klein Now you can copy any design from a Figma Make preview to the design canvas, allowing you to edit, iterate, and take your ideas further.",
    "Dec 3, 2025-Hug and fractional units for grid",
    "December 10, 2025-Introducing three new tools for precise image editing in Figma",
    "December 11, 2025-By Sean Lee, Megan Bednarczyk We’re expanding the capabilities of the Figma app in ChatGPT, so you can turn your ideas into creative assets and presentations that you can polish in Figma Buzz and Figma Slides.",
    "October 30, 2025-By Dylan Field Figma has acquired Weavy , a platform that brings generative AI and professional editing tools into the open canvas. As Figma Weave, the company will help build out image, video, animation, motion design, and VFX media generation and editing capability on the Figma platform.",
    "August 6, 2025-By Ana Boyer Paired with MCP servers, design systems become a productivity coefficient for AI-powered workflows, ensuring that AI agents produce output that’s relevant and on brand.",
    "November 20, 2025-Creativity meets precision with Google's Nano Banana Pro",
    "Dec 19, 2025-Last note for 2025",
    "December 16, 2025-By Emma Webster A growing number of product managers are finding that the fastest way to clarity is to build. Inside Figma Make, they’re pressure-testing assumptions early, building momentum, and rallying teams around something tangible.",
    "December 10, 2025-By Marvin Qian Today we’re introducing three new AI image editing tools that make precision editing faster, cleaner, and more intuitive—powering a more complete creative workflow in Figma.",
    "Dec 9, 2025-See your AI credit usage in Figma",
    "Nov 19, 2025-Make connectors for Notion, Linear, Atlassian, and more",
    "October 8, 2025-By Jenny Xie From redrawing product roadmaps to building starter templates, these Figma Make ideas from Maven Clinic, Pendo, ServiceNow, and LinkedIn show how designers can prompt a path forward.",
    "April 24, 2025-By Andrew Hogan Figma’s AI report tells us how designers and developers are navigating the changing landscape.",
    "Dec 11, 2025-Disable Figma Templates in Buzz",
    "Nov 19, 2025-Build dynamic, content-rich websites with Figma Sites CMS, now in public beta",
    "Dec 9, 2025-Metadata improvements for Figma Make and Sites",
    "Oct 22, 2025-Switch accounts easily on the mobile app",
    "November 12, 2025-By Figma With our new hub in Bengaluru, we’re investing in India’s fast-growing product development community.",
    "September 9, 2025-By Emma Webster With more teams moving faster than ever, the real differentiator is craft—the curiosity, intuition, taste, and intention behind every detail.",
    "May 7, 2025-By Aosheng Ran, Natasha Tenggoro, Kaitie Chambers With Figma Buzz, brand designers and marketers have a shared space to build beautiful, on-brand assets at scale.",
    "Oct 23, 2025-New features in Figma Buzz",
    "Dec 11, 2025-Make in Figma for Government",
    "November 26, 2025-By Matt Alagiah Factory farms and rising costs are putting British Columbia’s small growers out of business at an alarming rate. To fight back, entrepreneur Aaron Veale used Figma Make to build a marketplace app that helps farmers sell their produce—all in a matter of weeks."
  ]
}